app/Controllers/Dashboard.php

    public function index()
    {
        $sensor = $this->sensorModel->get_chart_data()->getResultArray();
        $device = $this->modelDevice->findAll();
---
SELECT *
FROM `devices`