app/Controllers/FuzzyLogic.php

    public function index()
    {

        $dataSensor = $this->sensorModel->findAll();
---
SELECT *
FROM `sensor`