app/Controllers/Sensor.php

UPDATE `sensor` SET `watt` = '0.016 kWh', `updated_at` = '2023-07-26 00:28:16'
WHERE `sensor`.`id_sensor` IN ('3')
UPDATE `devices` SET `status` = 'Online'
WHERE `id_device` = ('18')
---
                ];
            }

            $this->sensorModel->update($id_sensor, $data);

            echo $decoded->id;
            echo $decoded->state;
            $this->deviceModel->set('status', 'Online')->where('id_device', $id_device)->update();