app/Models/AlertModel.php

SELECT *
FROM `alert`
JOIN `devices` ON `devices`.`id_device`=`alert`.`id_device`
WHERE `alert`.`status` = 'non_checked'
---
    public function getAlertStatus()
    {
        return $this->db->table('alert')
            ->join('devices', 'devices.id_device=alert.id_device')
            ->where('alert.status', 'non_checked')
            ->get();

UPDATE `alert` SET `type_alert` = 'Normal', `status` = 'checked'
WHERE `id_alert` = '2'
---
    public function updateStatus($id)
    {
        $data = [
            'type_alert' => 'Normal',
            'status' => 'checked'
        ];
        return $this->set($data)
            ->where('id_alert', $id)
            ->update();

SELECT COUNT(*) AS `numrows`
FROM `alert`
WHERE `status` = 'non_checked'
---
    public function totalAlerts()
    {
        return $this
            ->where('status', 'non_checked')
            ->countAllResults();

SELECT `id_alert`
FROM `alert`
 LIMIT 1
---
    public function getFirstId()
    {
        return $this->select('id_alert')->first();