app/Models/DeviceModel.php

SELECT *
FROM `devices`
JOIN `sensor` ON `sensor`.`id_device`=`devices`.`id_device`
JOIN `alert` ON `alert`.`id_device`=`devices`.`id_device`
WHERE `devices`.`id_device` = '18'
 LIMIT 1
---
    public function getDevice($id)
    {
        return $this->where('devices.id_device', $id)
            ->join('sensor', 'sensor.id_device=devices.id_device')
            ->join('alert', 'alert.id_device=devices.id_device')
            ->first();

SELECT COUNT(*) AS `numrows` FROM `devices`
---
    public function totalDevices()
    {
        return $this->db->table('devices')->countAll();

SELECT `id_device`
FROM `devices`
 LIMIT 1
---
    public function getFirstId()
    {
        return $this->select('id_device')->first();

SELECT COUNT(*) AS `numrows`
FROM `devices`
WHERE `status` = 'Online'
---
    public function totalOnline()
    {
        return $this->where('status', 'Online')
            ->countAllResults();