app/Models/SensorModel.php

    public function get_chart_data()
    {
        return $this->db->table('sensor')
            ->join('devices', 'devices.id_device=sensor.id_device')
            ->get();
---
SELECT *
FROM `sensor`
JOIN `devices` ON `devices`.`id_device`=`sensor`.`id_device`

    public function getFirstId()
    {
        return $this->select('id_sensor')->first();
---
SELECT `id_sensor`
FROM `sensor`
 LIMIT 1